a, b, c = map(int,input("Введите числа: ").split())
if a<b<c:
    print("Условие выполняется")
else:
    print("Условие не выполняется")
##########################################################
a, b, c = map(int,input("Введите числа: ").split())
if a>=b>=c:
    a=a*2
    b=b*2
    c=c*2
else:
    abs(a)
    abs(b)
    abs(c)
print(a,b,c)
##########################################################
a, b = map(int,input("Введите числа: ").split())
if a<=b:
    a=0
print(a,b)
##########################################################
a, b, c = map(int,input("Введите числа: ").split())
if a in range(1,4):
    print("A Пренадлежит интервалу 1-3")
if b in range(1,4):
    print("B Пренадлежит интервалу 1-3")
if c in range(1,4):
    print("C Пренадлежит интервалу 1-3")
#####################################################
a, b, c = map(int,input("Введите числа: ").split())
if b-a!=0:
    d=b-a
if d==c-b:
    print("Найдена прогрессия. Разница прогрессии:", d)
else:
    print("Прогрессий не найдено")
########################################################
x, y = map(int,input("Введите числа: ").split())
if x, y in range(-1,1):
    print("Точка находится внутри квадрата В")
    
R = ((x**2)+(y**2))**0.5

if R<=range(-1,1):
    if R>=range(-0.5,0.5):
        print("Точка находится внутри круга Б")
    else:
        print("Точка находится внутри круга А")
#########################################################
